const IRAN_PROVINCES = {
  "آذربایجان شرقی": [
    "تبریز",
    "مراغه",
    "مرند",
    "اهر",
    "بناب",
    "میانه",
    "هریس",
    "سراب",
    "شبستر",
    "بستان آباد"
  ],

  "آذربایجان غربی": [
    "ارومیه",
    "خوی",
    "مهاباد",
    "بوکان",
    "سلماس",
    "نقده",
    "پیرانشهر",
    "شاهین دژ",
    "ماکو"
  ],

  "اردبیل": [
    "اردبیل",
    "مشگین شهر",
    "خلخال",
    "پارس آباد",
    "نمین",
    "گرمی"
  ],

  "اصفهان": [
    "اصفهان",
    "کاشان",
    "نجف آباد",
    "خمینی شهر",
    "شاهین شهر",
    "فولادشهر",
    "گلپایگان",
    "نطنز"
  ],

  "البرز": [
    "کرج",
    "فردیس",
    "نظرآباد",
    "هشتگرد",
    "طالقان"
  ],

  "ایلام": [
    "ایلام",
    "دهلران",
    "مهران",
    "آبدانان"
  ],

  "بوشهر": [
    "بوشهر",
    "برازجان",
    "گناوه",
    "دیر",
    "جم"
  ],

  "تهران": [
    "تهران",
    "ری",
    "اسلامشهر",
    "شهریار",
    "ورامین",
    "پردیس",
    "قدس",
    "دماوند",
    "رباط کریم",
    "پاکدشت",
    "پرند",
    "بومهن"
  ],

  "چهارمحال و بختیاری": [
    "شهرکرد",
    "بروجن",
    "فارسان",
    "لردگان"
  ],

  "خراسان جنوبی": [
    "بیرجند",
    "قائن",
    "فردوس",
    "طبس"
  ],

  "خراسان رضوی": [
    "مشهد",
    "نیشابور",
    "سبزوار",
    "تربت حیدریه",
    "قوچان",
    "کاشمر",
    "چناران"
  ],

  "خراسان شمالی": [
    "بجنورد",
    "شیروان",
    "اسفراین"
  ],

  "خوزستان": [
    "اهواز",
    "آبادان",
    "خرمشهر",
    "دزفول",
    "اندیمشک",
    "بهبهان",
    "ماهشهر",
    "شادگان"
  ],

  "زنجان": [
    "زنجان",
    "ابهر",
    "خرمدره",
    "قیدار"
  ],

  "سمنان": [
    "سمنان",
    "شاهرود",
    "دامغان",
    "گرمسار"
  ],

  "سیستان و بلوچستان": [
    "زاهدان",
    "زابل",
    "ایرانشهر",
    "چابهار",
    "خاش"
  ],

  "فارس": [
    "شیراز",
    "مرودشت",
    "فسا",
    "جهرم",
    "لار",
    "کازرون",
    "داراب"
  ],

  "قزوین": [
    "قزوین",
    "تاکستان",
    "آبیک"
  ],

  "قم": [
    "قم"
  ],

  "کردستان": [
    "سنندج",
    "سقز",
    "بانه",
    "قروه",
    "بیجار"
  ],

  "کرمان": [
    "کرمان",
    "رفسنجان",
    "سیرجان",
    "جیرفت",
    "بم"
  ],

  "کرمانشاه": [
    "کرمانشاه",
    "اسلام آباد غرب",
    "سنقر",
    "کنگاور"
  ],

  "کهگیلویه و بویراحمد": [
    "یاسوج",
    "گچساران",
    "دهدشت"
  ],

  "گلستان": [
    "گرگان",
    "گنبد کاووس",
    "علی آباد",
    "آق قلا"
  ],

  "گیلان": [
    "رشت",
    "انزلی",
    "لاهیجان",
    "آستانه اشرفیه",
    "رودسر",
    "صومعه سرا"
  ],

  "لرستان": [
    "خرم آباد",
    "بروجرد",
    "دورود",
    "الیگودرز"
  ],

  "مازندران": [
    "ساری",
    "بابل",
    "آمل",
    "قائم شهر",
    "بابلسر",
    "چالوس",
    "نوشهر",
    "تنکابن"
  ],

  "مرکزی": [
    "اراک",
    "ساوه",
    "خمین",
    "محلات"
  ],

  "هرمزگان": [
    "بندرعباس",
    "قشم",
    "میناب",
    "بندرلنگه",
    "کیش"
  ],

  "همدان": [
    "همدان",
    "ملایر",
    "نهاوند",
    "تویسرکان",
    "کبودرآهنگ"
  ],

  "یزد": [
    "یزد",
    "میبد",
    "اردکان",
    "بافق"
  ]
};